#include <iostream>
using namespace std;
int main()
{
    //приклад 1 + 2 + 3+ ... + n
    int n = 10; //вказуємо кінець проміжку. (можна це зробити зразу в умові циклу без додаткової змінної)
    double sum = 0;  //створюємо дрібне число
    for(int i = 1; i<=n; i++){ //задаємо в циклі проміжок, тобто кількість ітерацій циклу
        sum =  sum + i;//вказуємо, що при кожній новій ітерації треба додавати певний вираз в змінну sum
        //та підставляємо в вираз змінну "i", яка кожну нову ітерацію циклу буде збільшуватися на 1
    }
    cout << sum;
    system("PAUSE"); //зупиняємо автоматичний вихід з консолі
}